config.org
#+TITLE: DOOM Config

* DOOM Config.el
** Initialization Settings
*** Lexical binding
#+BEGIN_SRC emacs-lisp
;;; config.el --- -*- lexical-binding: t -*-
#+END_SRC
*** Emacs Package Installers
**** MELPA/ELPA
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
#+END_SRC
**** GNU
#+BEGIN_SRC emacs-lisp
(add-to-list 'package-archives
         '("gnu" . "http://elpa.gnu.org/packages/"))
(package-initialize)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(setq package-check-signature nil)
(eval-when-compile
  (require 'use-package))
#+END_SRC
*** Optimizations
#+BEGIN_SRC emacs-lisp
(setq auto-window-vscroll nil)
(setq scroll-conservatively 101)
;; (add-to-list 'default-frame-alist '(inhibit-double-buffering . t))
#+END_SRC
(setq inhibit-compacting-font-caches t)
(setq linum-relative-backend 'display-line-numbers-mode)
(pixel-scroll-mode)
*** Tabs to Spaces
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC
*** Username + Email
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Shadorain"
      user-mail-address "shadorain7517@gmail.com")
#+END_SRC
*** Custom Time Stamp
<2020-08-24 Mon> --> [Mon, 08/24/20]
#+BEGIN_SRC emacs-lisp
(setq org-time-stamp-custom-formats '("[%a, %m/%d/%y]" . "[%a, %m/%d/%y -- %H:%M]"))
#+END_SRC
** Theming
*** Theme & Font
#+BEGIN_SRC emacs-lisp
(setq
 doom-font (font-spec :family "Mononoki Nerd Font" :size 16)
 doom-variable-pitch-font (font-spec :family "Mononoki Nerd Font" :size 16)
 doom-theme 'shado
 projectile-project-search-path '("~/.xmonad/" "~/Documents/Programming/" "~/dwm/"))
#+END_SRC
doom-font (font-spec :family "Agave" :size 16)
doom-theme 'doom-challenger-deep
doom-theme 'doom-one
data-format-on-save t)
*** Extra Colors
#+BEGIN_SRC emacs-lisp
(set-face-foreground 'line-number "#a1a1dd") ; Line number colors
(set-face-foreground 'line-number-current-line "#de286e") ; Current line number color
;; (add-to-list 'default-frame-alist '(background-color . "#0f0f17")) ; Background color
(add-to-list 'default-frame-alist '(background-color . "#08080d")) ; Background color
#+END_SRC
** Package config
**** Help Message
Here are some additional functions/macros that could help you configure Doom: - `load!' for loading external *.el files relative to this one - `use-package!' for configuring packages - `after!' for running code after a package has loaded - `add-load-path!' for adding directories to the `load-path', relative to this file. Emacs searches the `load-path' when you load packages with `require' or `use-package'. - `map!' for binding new keys
*** Annotate
#+BEGIN_SRC emacs-lisp
;; (annotate-mode)
#+END_SRC
*** Artist mode
#+BEGIN_SRC emacs-lisp
 ;;; integrate ido with artist-mode
   (defun artist-ido-select-operation (type)
     "Use ido to select a drawing operation in artist-mode"
     (interactive (list (ido-completing-read "Drawing operation: "
                                             (list "Pen" "Pen Line" "line" "straight line" "rectangle"
                                                   "square" "poly-line" "straight poly-line" "ellipse"
                                                   "circle" "text see-thru" "text-overwrite" "spray-can"
                                                   "erase char" "erase rectangle" "vaporize line" "vaporize lines"
                                                   "cut rectangle" "cut square" "copy rectangle" "copy square"
                                                   "paste" "flood-fill"))))
     (artist-select-operation type))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(defun artist-ido-select-settings (type)
     "Use ido to select a setting to change in artist-mode"
     (interactive (list (ido-completing-read "Setting: "
                                             (list "Set Fill" "Set Line" "Set Erase" "Spray-size" "Spray-chars"
                                                   "Rubber-banding" "Trimming" "Borders"))))
     (if (equal type "Spray-size")
       (artist-select-operation "spray set size")
       (call-interactively (artist-fc-get-fn-from-symbol
                (cdr (assoc type '(("Set Fill" . set-fill)
                           ("Set Line" . set-line)
                           ("Set Erase" . set-erase)
                           ("Rubber-banding" . rubber-band)
                           ("Trimming" . trimming)
                           ("Borders" . borders)
                           ("Spray-chars" . spray-chars))))))))
#+END_SRC
*** Avy
#+BEGIN_SRC emacs-lisp
;; (avy-setup-default)
(global-set-key (kbd "C-c C-j") 'avy-resume)
#+END_SRC
*** Company
#+BEGIN_SRC emacs-lisp
(require 'company)
(setq company-idle-delay 0.01
      company-minimum-prefix-length 2)
#+END_SRC
*** Deft
#+BEGIN_SRC emacs-lisp
(setq deft-directory "~/org"
      deft-exensions '("org")
      deft-recursive t)
#+END_SRC
*** Doom-Modeline
#+BEGIN_SRC emacs-lisp
(setq doom-modeline-height 10)
(set-face-attribute 'mode-line nil :family "Agave" :height 10)
(set-face-attribute 'mode-line-inactive nil :family "Agave" :height 10)
#+END_SRC
(doom-modeline-def-modeline 'main
  '(bar matches buffer-info remote-host buffer-position parrot selection-info)
  '(misc-info minor-modes input-method buffer-encoding major-mode process vcs checker))
(defun setup-custom-doom-modeline ()
   (doom-modeline-set-modeline 'my-simple-line 'default))
(add-hook 'doom-modeline-mode-hook 'setup-custom-doom-modeline)
*** ERC
#+BEGIN_SRC emacs-lisp
(defun start-erc ()
  "Log into freenode with less keystrokes"
  (interactive)
  (let
      ((password-cache nil))
    (erc
     :server "irc.freenode.net"
     :port "6667"
     :nick erc-nick
     :password erc-password)))
#+END_SRC
*** Escreen
#+BEGIN_SRC emacs-lisp
;; (load "escreen")
;; (escreen-install)
;; (global-set-key escreen-prefix-char 'escreen-prefix)
#+END_SRC
*** eyebrowse
#+BEGIN_SRC emacs-lisp
;; (require 'eyebrowse)
;; (use-package eyebrowse                  ; Easy workspaces creation and switching
  ;; :ensure t
  ;; :config
  ;;   (validate-setq eyebrowse-mode-line-separator " "
  ;;                   eyebrowse-new-workspace t)

  (eyebrowse-mode t)
#+END_SRC
*** Evil Snipe
#+BEGIN_SRC emacs-lisp
(require 'evil-snipe)
(evil-snipe-mode +1)
(evil-snipe-override-mode +1)
(add-hook 'magit-mode-hook 'turn-off-evil-snipe-override-mode)
#+END_SRC
*** Flycheck/spell
Be off by default
#+BEGIN_SRC emacs-lisp
(flyspell-mode 0)
#+END_SRC
*** Gpastel
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lib/gpastel/")
#+END_SRC
*** Haskell
#+BEGIN_SRC emacs-lisp
(setq haskell-process-log t)
(add-hook 'haskell-mode-hook 'haskell-indent-mode)
(add-hook 'haskell-mode-hook 'interactive-haskell-mode)
(add-hook 'haskell-mode-hook 'haskell-doc-mode)
(add-hook 'haskell-mode-hook 'hindent-mode)

(require 'lsp)
(require 'lsp-haskell)
(add-hook 'haskell-mode-hook #'lsp)
#+END_SRC
*** Hlinum
#+BEGIN_SRC emacs-lisp
(require 'hlinum)
(hlinum-activate)
(setq display-line-numbers-type 'relative) ; Relative line numbers with current line shown
#+END_SRC
*** Outline
#+BEGIN_SRC emacs-lisp
(use-package outline
  :diminish outline-minor-mode
  :config
  (use-package outline-minor-faces
    :ensure
    :hook
    (outline-minor-mode-hook . outline-minor-faces-add-font-lock-keywords)))
(global-set-key (kbd "C-`") 'outline-show-entry)
(global-set-key (kbd "C-~") 'outline-hide-entry)
#+END_SRC
*** Mu4e
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")
(require 'mu4e)
#+END_SRC
