config.el
;;; config.el --- -*- lexical-binding: t -*-

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)

(add-to-list 'package-archives
         '("gnu" . "http://elpa.gnu.org/packages/"))
(package-initialize)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(setq package-check-signature nil)
(eval-when-compile
  (require 'use-package))

(setq auto-window-vscroll nil)
(setq scroll-conservatively 101)
;; (add-to-list 'default-frame-alist '(inhibit-double-buffering . t))

(setq-default indent-tabs-mode nil)

(setq user-full-name "Shadorain"
      user-mail-address "shadorain7517@gmail.com")

(setq org-time-stamp-custom-formats '("[%a, %m/%d/%y]" . "[%a, %m/%d/%y -- %H:%M]"))

(setq
 doom-font (font-spec :family "Mononoki Nerd Font" :size 16)
 doom-variable-pitch-font (font-spec :family "Mononoki Nerd Font" :size 16)
 doom-theme 'shado
 projectile-project-search-path '("~/.xmonad/" "~/Documents/Programming/" "~/dwm/"))

(set-face-foreground 'line-number "#a1a1dd") ; Line number colors
(set-face-foreground 'line-number-current-line "#de286e") ; Current line number color
;; (add-to-list 'default-frame-alist '(background-color . "#0f0f17")) ; Background color
(add-to-list 'default-frame-alist '(background-color . "#08080d")) ; Background color

;; (annotate-mode)

;;; integrate ido with artist-mode
  (defun artist-ido-select-operation (type)
    "Use ido to select a drawing operation in artist-mode"
    (interactive (list (ido-completing-read "Drawing operation: "
                                            (list "Pen" "Pen Line" "line" "straight line" "rectangle"
                                                  "square" "poly-line" "straight poly-line" "ellipse"
                                                  "circle" "text see-thru" "text-overwrite" "spray-can"
                                                  "erase char" "erase rectangle" "vaporize line" "vaporize lines"
                                                  "cut rectangle" "cut square" "copy rectangle" "copy square"
                                                  "paste" "flood-fill"))))
    (artist-select-operation type))

(defun artist-ido-select-settings (type)
     "Use ido to select a setting to change in artist-mode"
     (interactive (list (ido-completing-read "Setting: "
                                             (list "Set Fill" "Set Line" "Set Erase" "Spray-size" "Spray-chars"
                                                   "Rubber-banding" "Trimming" "Borders"))))
     (if (equal type "Spray-size")
       (artist-select-operation "spray set size")
       (call-interactively (artist-fc-get-fn-from-symbol
                (cdr (assoc type '(("Set Fill" . set-fill)
                           ("Set Line" . set-line)
                           ("Set Erase" . set-erase)
                           ("Rubber-banding" . rubber-band)
                           ("Trimming" . trimming)
                           ("Borders" . borders)
                           ("Spray-chars" . spray-chars))))))))

;; (avy-setup-default)
(global-set-key (kbd "C-c C-j") 'avy-resume)

(require 'company)
(setq company-idle-delay 0.01
      company-minimum-prefix-length 2)

(setq deft-directory "~/org"
      deft-exensions '("org")
      deft-recursive t)

(setq doom-modeline-height 10)
(set-face-attribute 'mode-line nil :family "Agave" :height 10)
(set-face-attribute 'mode-line-inactive nil :family "Agave" :height 10)

(defun start-erc ()
  "Log into freenode with less keystrokes"
  (interactive)
  (let
      ((password-cache nil))
    (erc
     :server "irc.freenode.net"
     :port "6667"
     :nick erc-nick
     :password erc-password)))

;; (load "escreen")
;; (escreen-install)
;; (global-set-key escreen-prefix-char 'escreen-prefix)

;; (require 'eyebrowse)
;; (use-package eyebrowse                  ; Easy workspaces creation and switching
  ;; :ensure t
  ;; :config
  ;;   (validate-setq eyebrowse-mode-line-separator " "
  ;;                   eyebrowse-new-workspace t)

  (eyebrowse-mode t)

(require 'evil-snipe)
(evil-snipe-mode +1)
(evil-snipe-override-mode +1)
(add-hook 'magit-mode-hook 'turn-off-evil-snipe-override-mode)

(flyspell-mode 0)

(add-to-list 'load-path "~/.emacs.d/lib/gpastel/")

(setq haskell-process-log t)
(add-hook 'haskell-mode-hook 'haskell-indent-mode)
(add-hook 'haskell-mode-hook 'interactive-haskell-mode)
(add-hook 'haskell-mode-hook 'haskell-doc-mode)
(add-hook 'haskell-mode-hook 'hindent-mode)

(require 'lsp)
(require 'lsp-haskell)
(add-hook 'haskell-mode-hook #'lsp)

(require 'hlinum)
(hlinum-activate)
(setq display-line-numbers-type 'relative) ; Relative line numbers with current line shown

(use-package outline
  :diminish outline-minor-mode
  :config
  (use-package outline-minor-faces
    :ensure
    :hook
    (outline-minor-mode-hook . outline-minor-faces-add-font-lock-keywords)))
(global-set-key (kbd "C-`") 'outline-show-entry)
(global-set-key (kbd "C-~") 'outline-hide-entry)

(add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")
(require 'mu4e)
