config.org
*** Pdf-tools
#+BEGIN_SRC emacs-lisp
;; (require 'ox-latex)
;; (require 'pdf-tools)
;; ;; (setq Tex-auto-save t)
;; ;; (setq Tex-parse-self t)
;; ;; (setq-default Tex-master nil)
;; ;; (add-hook 'LaTeX-mode-hook 'visual-line-mode)
;; ;; (add-hook 'LaTeX-mode-hook 'flyspell-mode)
;; ;; (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
;; ;; (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
;; ;; (setq reftex-plug-into-AUCTeX t)
;; ;; (setq TeX-PDF-mode t)
;; ;; (pdf-tools-install)
;; (with-eval-after-load 'pdf-tools
;;     (require 'pdf-sync))
;; (use-package pdf-tools
;;   :init (pdf-tools-install)
;;   :bind (:map pdf-view-mode-map
;;         ("T" . pdf-annot-add-text-annotation)
;;         ("D" . pdf-annot-delete)
;;         ("t" . pdf-annot-add-highlight-markup-annotation)
;;         ("j" . image-next-line)
;;         ("k" . image-previous-line)
;;         ("l" . image-forward-hscroll)
;;         ("h" . image-backward-hscroll)
;;         ("G" . pdf-view-last-page)
;;         ("g" . nil)
;;         ("gg" . pdf-view-first-page)
;;         ("C-c C-c" . image-toggle-display)
;;         ("C-s" . isearch-forward))
;;   :config
;;   (setq-default pdf-view-display-size 'fit-page)
;;   :custom
;;   (yas-minor-mode nil)
;;   (pdf-cache-image-limit 32)
;;   (pdf-view-max-image-width 2048)
;;   (pdf-view-resize-factor 1.8)
;;   (pdf-isearch-batch-mode t)
;;   (pdf-annot-activate-created-annotations t))
;; (setq pdf-sync-backward-display-action t)
;; (setq pdf-sync-forward-display-action t)
#+END_SRC
#+BEGIN_SRC emacs-lisp
(use-package pdf-tools
  :ensure t
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-page)
  (setq pdf-annot-activate-created-annotations t)
  (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
  (define-key pdf-view-mode-map (kbd "C-r") 'isearch-backward)
  ;; (add-hook 'pdf-view-mode-hook (lambda ()
  ;;                 (bms/pdf-midnite-amber))) ; automatically turns on midnight-mode for pdfs
  )

;; (use-package auctex-latexmk
;;   :ensure t
;;   :config
;;   (auctex-latexmk-setup)
;;   (setq auctex-latexmk-inherit-TeX-PDF-mode t))

;; (use-package reftex
;;   :ensure t
;;   :defer t
;;   :config
;;   (setq reftex-cite-prompt-optional-args t)) ;; Prompt for empty optional arguments in cite

;; (use-package auto-dictionary
;;   :ensure t
;;   :init(add-hook 'flyspell-mode-hook (lambda () (auto-dictionary-mode 1))))

(use-package company-auctex
  :ensure t
  :init (company-auctex-init))

(use-package tex
  :ensure auctex
  :mode ("\\.tex\\'" . latex-mode)
  :config (progn
        (vimish-fold-from-marks)
        (setq TeX-source-correlate-mode t)
        (setq TeX-source-correlate-method 'synctex)
        (setq TeX-auto-save t)
        (setq TeX-parse-self t)
        (pdf-tools-install)
        (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
          TeX-source-correlate-start-server t)
        ;; Update PDF buffers after successful LaTeX runs
        (add-hook 'TeX-after-compilation-finished-functions
              #'TeX-revert-document-buffer)
        ))
#+END_SRC
Colors
#+BEGIN_SRC emacs-lisp
(add-hook 'pdf-view-mode-hook (lambda ()
                              (pdf-view-midnight-minor-mode))) ; automatically turns on midnight-mode for pdfs
(setq pdf-view-midnight-colors '("#BFAEE3" . "#0a0a12" )) ; #0a0a12 #6f88e8 #e1acff Set custom colors

(defun bms/pdf-no-filter ()
  "View pdf without colour filter."
  (interactive)
  (pdf-view-midnight-minor-mode -1))
#+END_SRC
*** Rainbow-mode
#+BEGIN_SRC emacs-lisp
; (use-package! rainbow-mode)
#+END_SRC
*** Yasnippet-snippets
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :config
  (yas-global-mode 1)
  (yas-load-directory "~/.doom.d/snippets/")
  (setq yasnippet-snippets-dir "~/.doom.d/snippets/"))
#+END_SRC
  (yas-load-directory "/usr/share/yasnippet-snippets"))
*** Vimish Folds
#+BEGIN_SRC emacs-lisp
(setq vimish-fold-find-marks-on-open t)
(turn-off-evil-vimish-fold-mode)
(vimish-fold-from-marks)
#+END_SRC
(setq vimish-fold-global-mode 1)
*** Whitespace Mode
#+BEGIN_SRC emacs-lisp
;; (global-whitespace-mode 1)
;; (progn
;;   (setq whitespace-style (quote (face spaces tabs space-mark tab-mark )))
;;   (setq whitespace-display-mappings
;;         '((space-mark 32 [183] [46]) ; SPACE 32 「 」, 183 MIDDLE DOT 「·」, 46 FULL STOP 「.」; 4347
;;           (tab-mark 9 [9655 9] [92 9])))) ; tabs
;; (add-hook 'c-mode-hook 'rc/set-up-whitespace-handling)
;; (add-hook 'emacs-lisp-mode 'rc/set-up-whitespace-handling)
;; (add-hook 'markdown-mode-hook 'rc/set-up-whitespace-handling)
;; (add-hook 'asm-mode-hook 'rc/set-up-whitespace-handling)
;; (add-hook 'nasm-mode-hook 'rc/set-up-whitespace-handling)
;; (add-hook 'haskell-mode-hook 'rc/set-up-whitespace-handling)
#+END_SRC
*** Eglot
#+BEGIN_SRC emacs-lisp
(require 'eglot)
(add-to-list 'eglot-server-programs '((c++-mode c-mode) "clangd"))
(add-hook 'c-mode-hook 'eglot-ensure)
(add-hook 'c++-mode-hook 'eglot-ensure)
#+END_SRC
** Latex
*** Auto-Compile + Refresh (latex)
Set up vars/funcs
#+BEGIN_SRC emacs-lisp
(setq
 split-width-threshold 0
 split-height-threshold nil)
(global-auto-revert-mode t)
#+END_SRC
These custom functions first time running will open the pdf in a split, concurring saves will update the pdf!
#+BEGIN_SRC emacs-lisp
(setq TeX-command-force "LaTex")
(defun latex-export-pdf-then-refresh()
  (TeX-command-master))
(defun latex-auto-export-on()
  (interactive)
    (add-hook 'after-save-hook 'latex-export-pdf-then-refresh t t)
    (TeX-command-run-all TeX-command-buffer)
    (windmove-left))
#+END_SRC
*** Auto-Compile + Refresh (from org -> latex)
These custom functions first time running will open the pdf in a split, concurring saves will update the pdf!
#+BEGIN_SRC emacs-lisp
(defun org-export-pdf-then-refresh()
  (org-latex-export-to-pdf))
(defun org-auto-export-on()
  (interactive)
  (cond
    ((string-match "LATEX_CMD: latex" (buffer-string))
     (add-hook 'after-save-hook 'org-export-pdf-then-refresh t t)
     (split-window-right)
     (windmove-right)
     (org-open-file (org-latex-export-to-pdf))
     (windmove-left))))
#+END_SRC
** Org-Mode
*** General org-mode
#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-highlight-latex-and-related nil)
  (setq org-hide-emphasis-markers t) ; Hides ugly markup symbols
  (setq org-agenda-skip-scheduled-if-done t
        org-ellipsis " ... "
        org-fontify-emphasized-text t
        ;; org-ellipsis "➞"
        ; org-add-link-type "yt" #'make-yt-link
        org-todo-keywords '((sequence "TODO(t)" "TIP(T)" "INPROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)"))
        org-todo-keyword-faces
        '(("TODO" :foreground "#943d84" :weight bold :underline t)
          ("TIP" :foreground "#29e3e3")
          ("WAITING" :foreground "#9f7efe" :weight normal :underline t)
          ("INPROGRESS" :foreground "#0098dd" :weight normal :underline t)
          ("DONE" :strike-through t :foreground "#2F2F4A" :background nil :weight light :underline t)
          ("CANCELLED" :strike-through t :foreground "#de286e" :background nil :weight light :underline t))
        org-priority-faces '((?A :foreground "#de286e")
                             (?B :foreground "#0098dd")
                             (?C :foreground "#a1a1dd"))
        ; org-tags-column -80
    ))
(setq org-directory "~/org/")
#+END_SRC
*** Org -> Markdown
#+BEGIN_SRC emacs-lisp
;; (defun md-auto-export-on()
;;   (interactive)
;;     (add-hook 'after-save-hook 'org-md-export-to-markdown)
;;     )
;; (eval-after-load 'org-mode
;;   '(local-set-key (kbd "C-m") #'md-auto-export-on))
#+END_SRC
*** org-startup-folded
#+BEGIN_SRC emacs-lisp
(setq org-startup-folded t)
#+END_SRC
*** Custom Links
#+BEGIN_SRC emacs-lisp
; (defun make-yt-link (youtube_id)
;   (browse-url (concat "https://www.youtube.com/embed/" youtube_id)))
#+END_SRC
*** Org Agenda
**** Custom Files
